Revit API Introduction Labs
LabUtils.GetParameterValue2 Method
 Helper to return parameter value as string, with additional support for element id to display the element type referred to.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static string GetParameterValue2(
	Parameter param,
	Document doc
)
Visual Basic (Declaration)
Public Shared Function GetParameterValue2 ( _
	param As Parameter, _
	doc As Document _
) As String
Visual C++
public:
static String^ GetParameterValue2(
	Parameter^ param,
	Document^ doc
)
Parameters
param
Type: Parameter
doc
Type: Document
See Also
LabUtils Class
Labs Namespace